regression2/t_oltp-innodb-multi/mysql-5.7.25/sysbench.8.res
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 8
Report intermediate results every 3 second(s)
Random number generator seed is 0 and will be ignored

Forcing shutdown in 181 seconds

Threads started!

[   3s] threads: 8, tps: 1539.00, reads: 21592.32, writes: 6166.00, response time: 7.18ms (95%), errors: 0.67, reconnects:  0.00
[   6s] threads: 8, tps: 1561.00, reads: 21846.66, writes: 6241.33, response time: 7.16ms (95%), errors: 0.33, reconnects:  0.00
[   9s] threads: 8, tps: 1595.00, reads: 22351.64, writes: 6378.66, response time: 7.07ms (95%), errors: 1.00, reconnects:  0.00
[  12s] threads: 8, tps: 1593.67, reads: 22283.03, writes: 6371.01, response time: 6.88ms (95%), errors: 0.00, reconnects:  0.00
[  15s] threads: 8, tps: 1607.33, reads: 22536.35, writes: 6434.67, response time: 6.88ms (95%), errors: 0.33, reconnects:  0.00
[  18s] threads: 8, tps: 1582.66, reads: 22158.62, writes: 6327.99, response time: 6.89ms (95%), errors: 0.00, reconnects:  0.00
[  21s] threads: 8, tps: 1587.00, reads: 22228.71, writes: 6350.01, response time: 6.95ms (95%), errors: 0.67, reconnects:  0.00
[  24s] threads: 8, tps: 1623.33, reads: 22726.33, writes: 6496.67, response time: 6.78ms (95%), errors: 0.00, reconnects:  0.00
[  27s] threads: 8, tps: 1628.33, reads: 22798.33, writes: 6516.67, response time: 6.78ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 8, tps: 1614.66, reads: 22603.96, writes: 6457.32, response time: 6.71ms (95%), errors: 0.00, reconnects:  0.00
[  33s] threads: 8, tps: 1591.67, reads: 22281.06, writes: 6366.68, response time: 6.80ms (95%), errors: 0.00, reconnects:  0.00
[  36s] threads: 8, tps: 1620.33, reads: 22688.28, writes: 6482.65, response time: 6.85ms (95%), errors: 0.00, reconnects:  0.00
[  39s] threads: 8, tps: 1584.33, reads: 22183.65, writes: 6336.00, response time: 6.90ms (95%), errors: 0.33, reconnects:  0.00
[  42s] threads: 8, tps: 1583.33, reads: 22147.65, writes: 6326.66, response time: 6.90ms (95%), errors: 0.00, reconnects:  0.00
[  45s] threads: 8, tps: 1589.33, reads: 22271.34, writes: 6365.34, response time: 6.81ms (95%), errors: 0.00, reconnects:  0.00
[  48s] threads: 8, tps: 1592.00, reads: 22288.02, writes: 6359.34, response time: 6.90ms (95%), errors: 0.33, reconnects:  0.00
[  51s] threads: 8, tps: 1602.00, reads: 22401.99, writes: 6406.66, response time: 6.88ms (95%), errors: 0.00, reconnects:  0.00
[  54s] threads: 8, tps: 1623.00, reads: 22752.63, writes: 6502.66, response time: 6.79ms (95%), errors: 0.00, reconnects:  0.00
[  57s] threads: 8, tps: 1603.00, reads: 22437.34, writes: 6409.34, response time: 6.87ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 8, tps: 1615.67, reads: 22624.05, writes: 6465.35, response time: 6.75ms (95%), errors: 0.00, reconnects:  0.00
[  63s] threads: 8, tps: 1606.00, reads: 22481.71, writes: 6422.01, response time: 6.81ms (95%), errors: 0.00, reconnects:  0.00
[  66s] threads: 8, tps: 1587.33, reads: 22228.29, writes: 6350.66, response time: 6.84ms (95%), errors: 0.33, reconnects:  0.00
[  69s] threads: 8, tps: 1642.33, reads: 22992.66, writes: 6568.00, response time: 6.80ms (95%), errors: 0.00, reconnects:  0.00
[  72s] threads: 8, tps: 1642.00, reads: 22989.33, writes: 6570.67, response time: 6.69ms (95%), errors: 0.00, reconnects:  0.00
[  75s] threads: 8, tps: 1608.67, reads: 22522.02, writes: 6427.67, response time: 6.80ms (95%), errors: 0.33, reconnects:  0.00
[  78s] threads: 8, tps: 1622.66, reads: 22721.29, writes: 6497.65, response time: 6.85ms (95%), errors: 0.33, reconnects:  0.00
[  81s] threads: 8, tps: 1585.00, reads: 22192.04, writes: 6340.01, response time: 6.99ms (95%), errors: 0.00, reconnects:  0.00
[  84s] threads: 8, tps: 1599.33, reads: 22389.66, writes: 6393.33, response time: 6.85ms (95%), errors: 0.00, reconnects:  0.00
[  87s] threads: 8, tps: 1585.00, reads: 22193.68, writes: 6343.34, response time: 6.94ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 8, tps: 1647.33, reads: 23062.22, writes: 6589.97, response time: 6.70ms (95%), errors: 0.00, reconnects:  0.00
[  93s] threads: 8, tps: 1631.67, reads: 22832.05, writes: 6524.01, response time: 6.71ms (95%), errors: 0.00, reconnects:  0.00
[  96s] threads: 8, tps: 1642.67, reads: 23009.11, writes: 6573.03, response time: 6.73ms (95%), errors: 0.00, reconnects:  0.00
[  99s] threads: 8, tps: 1609.66, reads: 22534.90, writes: 6437.64, response time: 6.78ms (95%), errors: 0.00, reconnects:  0.00
[ 102s] threads: 8, tps: 1616.34, reads: 22627.78, writes: 6466.70, response time: 6.83ms (95%), errors: 0.00, reconnects:  0.00
[ 105s] threads: 8, tps: 1600.66, reads: 22410.29, writes: 6402.66, response time: 6.79ms (95%), errors: 0.00, reconnects:  0.00
[ 108s] threads: 8, tps: 1596.66, reads: 22345.62, writes: 6378.99, response time: 6.84ms (95%), errors: 0.33, reconnects:  0.00
[ 111s] threads: 8, tps: 1606.66, reads: 22497.62, writes: 6426.65, response time: 6.87ms (95%), errors: 0.00, reconnects:  0.00
[ 114s] threads: 8, tps: 1615.34, reads: 22618.44, writes: 6465.36, response time: 6.79ms (95%), errors: 0.00, reconnects:  0.00
[ 117s] threads: 8, tps: 1631.00, reads: 22847.96, writes: 6530.32, response time: 6.78ms (95%), errors: 0.67, reconnects:  0.00
[ 120s] threads: 8, tps: 1659.34, reads: 23229.39, writes: 6634.68, response time: 6.78ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            2722594
        write:                           777837
        other:                           388925
        total:                           3889356
    transactions:                        194454 (1606.98 per sec.)
    read/write requests:                 3500431 (28927.71 per sec.)
    other operations:                    388925 (3214.09 per sec.)
    ignored errors:                      17     (0.14 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          121.0062s
    total number of events:              194454
    total time taken by event execution: 967.4552s
    response time:
         min:                                  1.69ms
         avg:                                  4.98ms
         max:                                 27.77ms
         approx.  95 percentile:               6.85ms

Threads fairness:
    events (avg/stddev):           24306.7500/341.87
    execution time (avg/stddev):   120.9319/0.00